{
  "privacy_policy": {
    "date": {
      "en": "December 18, 2025",
      "pt": "18 de dezembro de 2025",
      "fr": "18 décembre 2025",
      "es": "18 de diciembre de 2025",
      "de": "18. Dezember 2025"
    },
    "sections": [
      {
        "content": {
          "en": "1. Introduction\nWelcome to my Portfolio (\"I\", \"Me\", \"My\"). I respect your privacy and am committed to protecting it through this policy. This policy describes the types of information I may collect from you or that you may provide when you access or use this Website and App (collectively, \"Service\") and my practices for collecting, using, maintaining, protecting, and disclosing that information.",
          "pt": "1. Introdução\nBem-vindo ao meu Portfólio (\"Eu\", \"Meu\"). Respeito sua privacidade e estou comprometido em protegê-la através desta política. Esta política descreve os tipos de informações que posso coletar de você ou que você pode fornecer ao acessar ou usar este Site e Aplicativo (coletivamente, \"Serviço\") e minhas práticas para coletar, usar, manter, proteger e divulgar essas informações.",
          "fr": "1. Introduction\nBienvenue sur mon Portfolio (\"Je\", \"Moi\", \"Mon\"). Je respecte votre vie privée et m'engage à la protéger via cette politique. Cette politique décrit les types d'informations que je peux collecter auprès de vous ou que vous pouvez fournir lorsque vous accédez ou utilisez ce site Web et cette application (collectivement, \"Service\") et mes pratiques de collecte, d'utilisation, de maintien, de protection et de divulgation de ces informations.",
          "es": "1. Introducción\nBienvenido a mi Portafolio (\"Yo\", \"Mí\", \"Mi\"). Respeto su privacidad y me comprometo a protegerla a través de esta política. Esta política describe los tipos de información que puedo recopilar de usted o que usted puede proporcionar cuando accede o utiliza este sitio web y aplicación (colectivamente, \"Servicio\") y mis prácticas para recopilar, usar, mantener, proteger y divulgar esa información.",
          "de": "1. Einführung\nWillkommen in meinem Portfolio (\"Ich\", \"Mir\", \"Mein\"). Ich respektiere Ihre Privatsphäre und verpflichte mich, sie durch diese Richtlinie zu schützen. Diese Richtlinie beschreibt die Arten von Informationen, die ich von Ihnen sammeln kann oder die Sie bereitstellen können, wenn Sie auf diese Website und App (zusammenfassend \"Dienst\") zugreifen oder diese nutzen, sowie meine Praktiken zum Sammeln, Verwenden, Pflegen, Schützen und Offenlegen dieser Informationen."
        }
      },
      {
        "content": {
          "en": "2. Information I Collect\nThis Service is primarily for informational purposes to showcase my professional portfolio. I do not actively collect personal data from visitors through this Service, such as names, addresses, or phone numbers, unless you voluntarily provide it to me (e.g., by contacting me via email).",
          "pt": "2. Informações Que Coleto\nEste Serviço é principalmente para fins informativos para mostrar meu portfólio profissional. Não coleto ativamente dados pessoais de visitantes através deste Serviço, como nomes, endereços ou números de telefone, a menos que você os forneça voluntariamente (por exemplo, entrando em contato comigo por e-mail).",
          "fr": "2. Informations Que Je Collecte\nCe Service est principalement à des fins d'information pour présenter mon portefeuille professionnel. Je ne collecte pas activement de données personnelles auprès des visiteurs via ce Service, telles que des noms, des adresses ou des numéros de téléphone, à moins que vous ne me les fournissiez volontairement (par exemple, en me contactant par e-mail).",
          "es": "2. Información Que Recopilo\nEste Servicio es principalmente para fines informativos para mostrar mi portafolio profesional. No recopilo activamente datos personales de los visitantes a través de este Servicio, como nombres, direcciones o números de teléfono, a menos que usted me los proporcione voluntariamente (por ejemplo, contactándome por correo electrónico).",
          "de": "2. Informationen, die ich sammle\nDieser Dienst dient hauptsächlich Informationszwecken, um mein professionelles Portfolio zu präsentieren. Ich sammle über diesen Dienst keine personenbezogenen Daten von Besuchern, wie Namen, Adressen oder Telefonnummern, es sei denn, Sie stellen mir diese freiwillig zur Verfügung (z. B. indem Sie mich per E-Mail kontaktieren)."
        }
      },
      {
        "content": {
          "en": "3. Automatic Data Collection\nLike many websites and apps, this Service may automatically collect standard internet log information and visitor behavior details. This may include:\n- IP address\n- Device and Browser type\n- Access times\nThis information is used to improve the Service and ensure its security and proper operation. It is not linked to your personal identity.",
          "pt": "3. Coleta Automática de Dados\nComo muitos sites e aplicativos, este Serviço pode coletar automaticamente informações padrão de log da internet e detalhes do comportamento do visitante. Isso pode incluir:\n- Endereço IP\n- Tipo de Dispositivo e Navegador\n- Horários de acesso\nEssas informações são usadas para melhorar o Serviço e garantir sua segurança e operação adequada. Não está vinculado à sua identidade pessoal.",
          "fr": "3. Collecte Automatique de Données\nComme de nombreux sites Web et applications, ce Service peut collecter automatiquement des informations standard de journal Internet et des détails sur le comportement des visiteurs. Cela peut inclure :\n- Adresse IP\n- Type d'appareil et de navigateur\n- Heures d'accès\nCes informations sont utilisées pour améliorer le Service et assurer sa sécurité et son bon fonctionnement. Elles ne sont pas liées à votre identité personnelle.",
          "es": "3. Recopilación Automática de Datos\nAl igual que muchos sitios web y aplicaciones, este Servicio puede recopilar automáticamente información estándar de registro de Internet y detalles del comportamiento de los visitantes. Esto puede incluir:\n- Dirección IP\n- Tipo de dispositivo y navegador\n- Tiempos de acceso\nEsta información se utiliza para mejorar el Servicio y garantizar su seguridad y correcto funcionamiento. No está vinculada a su identidad personal.",
          "de": "3. Automatische Datenerfassung\nWie viele Websites und Apps kann dieser Dienst automatisch Standard-Internetprotokollinformationen und Details zum Besucherverhalten erfassen. Dies kann Folgendes umfassen:\n- IP-Adresse\n- Geräte- und Browsertyp\n- Zugriffszeiten\nDiese Informationen werden verwendet, um den Dienst zu verbessern und seine Sicherheit und ordnungsgemäße Funktion zu gewährleisten. Sie sind nicht mit Ihrer persönlichen Identität verknüpft."
        }
      },
      {
        "content": {
          "en": "4. Cookies and Local Storage\nThis Service may use cookies or local storage to enhance your experience. You can set your browser or device settings to refuse all or some cookies, or to alert you when cookies are being sent.",
          "pt": "4. Cookies e Armazenamento Local\nEste Serviço pode usar cookies ou armazenamento local para melhorar sua experiência. Você pode configurar seu navegador ou dispositivo para recusar todos ou alguns cookies, ou para alertá-lo quando os cookies estiverem sendo enviados.",
          "fr": "4. Cookies et Stockage Local\nCe Service peut utiliser des cookies ou un stockage local pour améliorer votre expérience. Vous pouvez configurer les paramètres de votre navigateur ou de votre appareil pour refuser tous ou certains cookies, ou pour vous alerter lorsque des cookies sont envoyés.",
          "es": "4. Cookies y Almacenamiento Local\nEste Servicio puede utilizar cookies o almacenamiento local para mejorar su experiencia. Puede configurar su navegador o dispositivo para rechazar todas o algunas cookies, o para avisarle cuando se envíen cookies.",
          "de": "4. Cookies und lokaler Speicher\nDieser Dienst kann Cookies oder lokalen Speicher verwenden, um Ihre Erfahrung zu verbessern. Sie können Ihre Browser- oder Geräteeinstellungen so konfigurieren, dass alle oder einige Cookies abgelehnt werden oder Sie benachrichtigt werden, wenn Cookies gesendet werden."
        }
      },
      {
        "content": {
          "en": "5. Contact Information\nIf you have any questions about this privacy policy, please contact me through the contact channels provided on the home page.",
          "pt": "5. Informações de Contato\nSe você tiver alguma dúvida sobre esta política de privacidade, entre em contato comigo através dos canais de contato fornecidos na página inicial.",
          "fr": "5. Coordonnées\nSi vous avez des questions concernant cette politique de confidentialité, veuillez me contacter via les canaux de contact fournis sur la page d'accueil.",
          "es": "5. Información de Contacto\nSi tiene alguna pregunta sobre esta política de privacidad, comuníquese conmigo a través de los canales de contacto proporcionados en la página de inicio.",
          "de": "5. Kontaktinformationen\nWenn Sie Fragen zu dieser Datenschutzerklärung haben, kontaktieren Sie mich bitte über die auf der Startseite angegebenen Kontaktkanäle."
        }
      }
    ]
  },
  "terms_of_use": {
    "date": {
      "en": "December 18, 2025",
      "pt": "18 de dezembro de 2025",
      "fr": "18 décembre 2025",
      "es": "18 de diciembre de 2025",
      "de": "18. Dezember 2025"
    },
    "sections": [
      {
        "content": {
          "en": "1. Acceptance of Terms\nBy accessing and using this Website and App (collectively, \"Service\"), you accept and agree to be bound by the terms and provision of this agreement. In addition, when using this Service's particular services, you shall be subject to any posted guidelines or rules applicable to such services.",
          "pt": "1. Aceitação dos Termos\nAo acessar e usar este Site e Aplicativo (coletivamente, \"Serviço\"), você aceita e concorda em estar vinculado aos termos e disposições deste contrato. Além disso, ao usar os serviços específicos deste Serviço, você estará sujeito a quaisquer diretrizes ou regras publicadas aplicáveis ​​a tais serviços.",
          "fr": "1. Acceptation des Conditions\nEn accédant et en utilisant ce site Web et cette application (collectivement, \"Service\"), vous acceptez et convenez d'être lié par les termes et dispositions de cet accord. De plus, lors de l'utilisation des services particuliers de ce Service, vous serez soumis à toutes les directives ou règles publiées applicables à ces services.",
          "es": "1. Aceptación de los Términos\nAl acceder y utilizar este sitio web y aplicación (colectivamente, \"Servicio\"), usted acepta y acuerda estar sujeto a los términos y disposiciones de este acuerdo. Además, al utilizar los servicios particulares de este Servicio, estará sujeto a las pautas o reglas publicadas aplicables a dichos servicios.",
          "de": "1. Annahme der Bedingungen\nDurch den Zugriff auf und die Nutzung dieser Website und App (zusammenfassend \"Dienst\") akzeptieren Sie die Bedingungen und Bestimmungen dieser Vereinbarung und erklären sich damit einverstanden. Darüber hinaus unterliegen Sie bei der Nutzung der besonderen Dienste dieses Dienstes allen veröffentlichten Richtlinien oder Regeln, die für diese Dienste gelten."
        }
      },
      {
        "content": {
          "en": "2. Use License\nPermission is granted to temporarily view the materials (information or software) on this Service for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title, and under this license you may not:\n- Modify or copy the materials;\n- Use the materials for any commercial purpose, or for any public display (commercial or non-commercial);\n- Attempt to decompile or reverse engineer any software contained on the Service;\n- Remove any copyright or other proprietary notations from the materials.",
          "pt": "2. Licença de Uso\nÉ concedida permissão para visualizar temporariamente os materiais (informações ou software) neste Serviço apenas para visualização transitória pessoal e não comercial. Esta é a concessão de uma licença, não uma transferência de título, e sob esta licença você não pode:\n- Modificar ou copiar os materiais;\n- Usar os materiais para qualquer finalidade comercial ou para qualquer exibição pública (comercial ou não comercial);\n- Tentar descompilar ou fazer engenharia reversa de qualquer software contido no Serviço;\n- Remover quaisquer direitos autorais ou outras notações de propriedade dos materiais.",
          "fr": "2. Licence d'Utilisation\nL'autorisation est accordée de visualiser temporairement les documents (informations ou logiciels) sur ce Service pour une visualisation transitoire personnelle et non commerciale uniquement. Il s'agit de l'octroi d'une licence, et non d'un transfert de titre, et en vertu de cette licence, vous ne pouvez pas :\n- Modifier ou copier les documents ;\n- Utiliser les documents à des fins commerciales ou pour toute exposition publique (commerciale ou non commerciale) ;\n- Tenter de décompiler ou de faire de l'ingénierie inverse sur tout logiciel contenu dans le Service ;\n- Supprimer tout droit d'auteur ou autre notation de propriété des documents.",
          "es": "2. Licencia de Uso\nSe concede permiso para ver temporalmente los materiales (información o software) en este Servicio solo para visualización transitoria personal y no comercial. Esta es la concesión de una licencia, no una transferencia de título, y bajo esta licencia no puede:\n- Modificar o copiar los materiales;\n- Utilizar los materiales para cualquier propósito comercial, o para cualquier exhibición pública (comercial o no comercial);\n- Intentar descompilar o aplicar ingeniería inversa a cualquier software contenido en el Servicio;\n- Eliminar cualquier derecho de autor u otras anotaciones de propiedad de los materiales.",
          "de": "2. Nutzungslizenz\nEs wird die Erlaubnis erteilt, die Materialien (Informationen oder Software) in diesem Dienst vorübergehend nur für die persönliche, nichtkommerzielle vorübergehende Ansicht anzuzeigen. Dies ist die Erteilung einer Lizenz, keine Übertragung des Titels, und unter dieser Lizenz dürfen Sie nicht:\n- Die Materialien ändern oder kopieren;\n- Die Materialien für kommerzielle Zwecke oder für eine öffentliche Anzeige (kommerziell oder nichtkommerziell) verwenden;\n- Versuchen, Software, die im Dienst enthalten ist, zu dekompilieren oder zurückzuentwickeln;\n- Urheberrechts- oder andere Eigentumshinweise aus den Materialien entfernen."
        }
      },
      {
        "content": {
          "en": "3. Disclaimer\nThe materials on this Service are provided \"as is\". I make no warranties, expressed or implied, and hereby disclaim and negate all other warranties, including without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights.",
          "pt": "3. Isenção de Responsabilidade\nOs materiais neste Serviço são fornecidos \"como estão\". Não ofereço garantias, expressas ou implícitas, e, por meio deste, isento e nego todas as outras garantias, incluindo, sem limitação, garantias implícitas ou condições de comercialização, adequação a uma finalidade específica ou não violação de propriedade intelectual ou outra violação de direitos.",
          "fr": "3. Avis de Non-responsabilité\nLes documents sur ce Service sont fournis \"tels quels\". Je ne donne aucune garantie, expresse ou implicite, et rejette et nie par la présente toutes les autres garantias, y compris, sans limitation, les garanties implicites ou les conditions de qualité marchande, d'adéquation à un usage particulier ou de non-violation de la propriété intellectuelle ou autre violation des droits.",
          "es": "3. Descargo de Responsabilidad\nLos materiales en este Servicio se proporcionan \"tal cual\". No ofrezco garantías, expresas o implícitas, y por la presente renuncio y niego todas las demás garantías, incluidas, entre otras, las garantías implícitas o las condiciones de comerciabilidad, idoneidad para un propósito particular o no infracción de la propiedad intelectual u otra violación de derechos.",
          "de": "3. Haftungsausschluss\nDie Materialien in diesem Dienst werden \"wie besehen\" bereitgestellt. Ich gebe keine Garantien, weder ausdrücklich noch stillschweigend, und lehne hiermit alle anderen Garantien ab und negiere sie, einschließlich, aber nicht beschränkt auf stillschweigende Garantien oder Bedingungen der Marktgängigkeit, Eignung für einen bestimmten Zweck oder Nichtverletzung von geistigem Eigentum oder anderen Rechtsverletzungen."
        }
      },
      {
        "content": {
          "en": "4. Limitations\nIn no event shall I or my suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption) arising out of the use or inability to use the materials on this Service.",
          "pt": "4. Limitações\nEm nenhum caso eu ou meus fornecedores seremos responsáveis ​​por quaisquer danos (incluindo, sem limitação, danos por perda de dados ou lucro, ou devido à interrupção dos negócios) decorrentes do uso ou incapacidade de usar os materiais neste Serviço.",
          "fr": "4. Limitations\nEn aucun cas, je ou mes fournisseurs ne serons responsables de tout dommage (y compris, sans limitation, les dommages pour perte de données ou de profit, ou dus à une interruption d'activité) découlant de l'utilisation ou de l'impossibilité d'utiliser les documents sur ce Service.",
          "es": "4. Limitaciones\nEn ningún caso yo o mis proveedores seremos responsables de ningún daño (incluidos, entre otros, daños por pérdida de datos o ganancias, o debido a la interrupción del negocio) que surjan del uso o la imposibilidad de usar los materiales en este Servicio.",
          "de": "4. Beschränkungen\nIn keinem Fall haften ich oder meine Lieferanten für Schäden (einschließlich, aber nicht beschränkt auf Schäden durch Daten- oder Gewinnverlust oder aufgrund von Betriebsunterbrechungen), die sich aus der Nutzung oder der Unfähigkeit zur Nutzung der Materialien in diesem Dienst ergeben."
        }
      },
      {
        "content": {
          "en": "5. Revisions and Errata\nThe materials appearing on this Service could include technical, typographical, or photographic errors. I do not warrant that any of the materials on its Service are accurate, complete, or current. I may make changes to the materials contained on its Service at any time without notice.",
          "pt": "5. Revisões e Erratas\nOs materiais exibidos neste Serviço podem incluir erros técnicos, tipográficos ou fotográficos. Não garanto que qualquer um dos materiais em seu Serviço seja preciso, completo ou atual. Posso fazer alterações nos materiais contidos em seu Serviço a qualquer momento, sem aviso prévio.",
          "fr": "5. Révisions et Errata\nLes documents figurant sur ce Service peuvent inclure des erreurs techniques, typographiques ou photographiques. Je ne garantis pas que l'un des documents sur son Service est exact, complet ou à jour. Je peux apporter des modifications aux documents contenus sur son Service à tout moment sans préavis.",
          "es": "5. Revisiones y Erratas\nLos materiales que aparecen en este Servicio pueden incluir errores técnicos, tipográficos o fotográficos. No garantizo que ninguno de los materiales en su Servicio sea preciso, completo o actual. Puedo realizar cambios en los materiales contenidos en su Servicio en cualquier momento sin previo aviso.",
          "de": "5. Überarbeitungen und Errata\nDie in diesem Dienst erscheinenden Materialien können technische, typografische oder fotografische Fehler enthalten. Ich garantiere nicht, dass eines der Materialien in seinem Dienst korrekt, vollständig oder aktuell ist. Ich kann jederzeit ohne vorherige Ankündigung Änderungen an den in seinem Dienst enthaltenen Materialien vornehmen."
        }
      },
      {
        "content": {
          "en": "6. Governing Law\nAny claim relating to this Service shall be governed by the laws of my country of residence without regard to its conflict of law provisions.",
          "pt": "6. Lei Aplicável\nQualquer reivindicação relacionada a este Serviço será regida pelas leis do meu país de residência, sem levar em consideração seus conflitos de disposições legais.",
          "fr": "6. Droit Applicable\nToute réclamation relative à ce Service sera régie par les lois de mon pays de résidence sans tenir compte de ses dispositions en matière de conflit de lois.",
          "es": "6. Ley Aplicable\nCualquier reclamo relacionado con este Servicio se regirá por las leyes de mi país de residencia sin tener en cuenta sus disposiciones sobre conflictos de leyes.",
          "de": "6. Geltendes Recht\nJeder Anspruch im Zusammenhang mit diesem Dienst unterliegt den Gesetzen meines Wohnsitzlandes ohne Rücksicht auf dessen kollisionsrechtliche Bestimmungen."
        }
      }
    ]
  }
}
